docs/test_requests.txt

CSW-REQUEST -> IngridQuery Test
===============================

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
		 requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:service,csw:dataset">
<ElementSetName typeNames="">brief</ElementSetName>
<Constraint version="1.0.0">
<Filter xmlns="http://www.opengis.net/ogc">
<PropertyIsEqualTo>
<PropertyName>Title</PropertyName>
<Literal>Wasser</Literal>
</PropertyIsEqualTo>
</Filter>
</Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>

Result -> "titel:Wasser"


---------------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="10" outputFormat="text/xml" outputSchema="csw:profile"
		 requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:dataset">
<ElementSetName typeNames="">brief</ElementSetName>
 <Constraint version="1.0.0">
<Filter xmlns="http://www.opengis.net/ogc">
<And>
<PropertyIsEqualTo>
<PropertyName>AnyText</PropertyName>
<Literal>fische</Literal>
</PropertyIsEqualTo>
<PropertyIsEqualTo>
<PropertyName>GeographicDescriptionCode</PropertyName>
<Literal>halle</Literal>
</PropertyIsEqualTo>
<Not>
<Or>
<PropertyIsEqualTo>
<PropertyName>AnyText</PropertyName>
<Literal>saale</Literal>
</PropertyIsEqualTo>
<PropertyIsEqualTo>
<PropertyName>AnyText</PropertyName>
<Literal>hufeisensee</Literal>
</PropertyIsEqualTo>
</Or>
</Not>
</And>
</Filter>
</Constraint>
</Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>

Result -> "fische halle NOT (saale OR hufeisensee)"

------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
      requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:dataset">
<ElementSetName typeNames="">brief</ElementSetName>
<Constraint version="1.0.0">
<ogc:Filter xmlns:gml="http://www.opengis.net/gml" xmlns:ogc="http://www.opengis.net/ogc">  <PropertyIsEqualTo escape="\" singleChar="?" wildCard="*">    <PropertyName>Identifier</PropertyName>    <Literal>*3*</Literal>  </PropertyIsEqualTo></ogc:Filter></Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>

Result -> "zip:3*"

---------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
      requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:dataset">
<ElementSetName typeNames="">brief</ElementSetName>
<Constraint version="1.0.0">
<ogc:Filter xmlns:gml="http://www.opengis.net/gml" xmlns:ogc="http://www.opengis.net/ogc">  <PropertyIsGreaterThan>    <PropertyName>Modified</PropertyName>    <Literal>19901231</Literal>  </PropertyIsGreaterThan></ogc:Filter></Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>

Result -> "t01_object.mod_time:[1990-12-31 TO 3000-01-01]"


GET_CAPABILITY TEST (Test auf "<ows:Keywords>" in der Antwort.)
=================================================

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<GetCapabilities service="CSW" >
<AcceptVersions>
<Version>2.0.0</Version>
</AcceptVersions>
</GetCapabilities>
 </soapenv:Body>
</soapenv:Envelope>



RESPONSE TEST (schaut ob Ergebnisse geliefert werden, angeschlossen an das testssytem)
=====================================================

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
		 requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:service,csw:dataset">
<ElementSetName typeNames="">brief</ElementSetName>
<Constraint version="1.0.0">
<Filter xmlns="http://www.opengis.net/ogc">
<PropertyIsEqualTo>
<PropertyName>Title</PropertyName>
<Literal>Wasser</Literal>
</PropertyIsEqualTo>
</Filter>
</Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>

---------------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
      requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:dataset">
<ElementSetName typeNames="">summary</ElementSetName>
<Constraint version="1.0.0">
<Filter xmlns="http://www.opengis.net/ogc">
<PropertyIsEqualTo>
<PropertyName>Title</PropertyName>
<Literal>Wasser</Literal>
</PropertyIsEqualTo>
</Filter>
</Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>


-----------------


<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecords maxRecords="4" outputFormat="text/xml" outputSchema="csw:profile"
      requestId="csw:1" resultType="results" service="CSW" startPosition="1"
        version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Query typeNames="csw:dataset">
<ElementSetName typeNames="">full</ElementSetName>
<Constraint version="1.0.0">
<Filter xmlns="http://www.opengis.net/ogc">
<PropertyIsEqualTo>
<PropertyName>Title</PropertyName>
<Literal>Wasser</Literal>
</PropertyIsEqualTo>
</Filter>
</Constraint>
<SortBy>
<SortProperty>
<PropertyName>title</PropertyName>
<SortOrder>ASC</SortOrder>
</SortProperty>
</SortBy></Query>
</GetRecords>
 </soapenv:Body>
</soapenv:Envelope>


-----------------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetRecordById service="CSW" version="2.0.0" xmlns="http://www.opengis.net/cat/csw">
<Id>F3659A31-26C3-4017-BF82-6DCB483460D6</Id>
<ElementSetName>full</ElementSetName>
</GetRecordById>
 </soapenv:Body>
</soapenv:Envelope>



DESCRIBE_RECORD (test auf valide DescribeRecords)
=================================================

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<DescribeRecord service="CSW" version="2.0.0" outputFormat="text/xml" schemaLanguage="XMLSCHEMA"/>
 </soapenv:Body>
</soapenv:Envelope>

--------------------

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
                   xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<DescribeRecord service="CSW" version="2.0.0" />
 </soapenv:Body>
</soapenv:Envelope>



GetCapabilities (test auf valide Requests)
==========================================

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<GetCapabilities service="CSW" >
<AcceptVersions>
<Version>2.0.0</Version>
</AcceptVersions>
</GetCapabilities>
 </soapenv:Body>
</soapenv:Envelope>


<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"
xmlns:xsd="http://www.w3.org/2001/XMLSchema"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
 <soapenv:Body>
<GetCapabilities service="CSW" />
 </soapenv:Body>
</soapenv:Envelope>


Test auf valide KVP requests
============================

{REQUEST=GetCapabilities, SERVICE=CSW}


{REQUEST=GetCapabilities, ACCEPTVERSIONS=2.0.0, SERVICE=CSW}

{REQUEST=GetCapabilities, ACCEPTVERSIONS=1.0.0,2.0.0, SERVICE=CSW}

{REQUEST=GetCapabilities, ACCEPTVERSIONS=2.0.0,1.0.0, SERVICE=CSW}













